# Programming languages
## JVM
brew 'openjdk'
brew 'kotlin'
brew 'maven'
brew 'gradle'

## C
brew 'gcc'
brew 'cmake'

## Go
brew 'go'

## Python
brew 'python@3.12'

# CLI tools
brew 'git'
brew 'tree'
brew 'curl'
brew 'wget'
brew 'kubernetes-cli'
brew 'tmux'
brew 'zsh'
brew 'z'
brew 'fzf'
brew 'jq'
brew 'ripgrep'
brew 'gh'
# Graphite?
# used `brew install withgraphite/tap/graphite`
brew 'docker-compose'
brew 'kubectx'
tap 'ruimarinho/tap' # gsts (AWS), work
brew 'gsts'
brew 'awscli'
brew 'zsh-autosuggestions'
brew 'exa'
brew 'zsh-syntax-highlighting'

# Databases
brew 'duckdb'
brew 'sqlite'
brew 'postgresql'

# Other stuff
brew 'neovim'

# Casks (apps)
cask 'rectangle'
cask 'postman'
cask 'discord'
cask 'iterm2'
cask 'visual-studio-code'
cask 'sublime-text'
cask 'tailscale'
cask 'slack'
cask 'istat-menus'
cask 'spotify'
cask 'intellij-idea-ce'
cask 'docker'
# I had already installed Arc
# cask 'arc'
cask 'raycast'

# Fonts
tap 'homebrew/cask-fonts'
cask 'font-hack'
cask 'font-jetbrains-mono'
cask 'font-inconsolata'
cask 'font-roboto'
cask 'font-roboto-mono'
cask 'font-ibm-plex'
